In [1]:
import pandas as pd

In [3]:
Customers = pd.DataFrame({
    "id": [1,2,3,4],
    "name": ["Joe","Henry","Sam","Max"]
})
Orders = pd.DataFrame({
    "id": [1,2],
    "customer_id": [3,1]
})

In [4]:
Customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [5]:
Orders

   id  customer_id
0   1            3
1   2            1

In [6]:
merged = pd.merge(Customers,Orders,on="id",how="inner")

In [7]:
merged

   id   name  customer_id
0   1    Joe            3
1   2  Henry            1

In [8]:
pd.merge(Orders,Customers,on="id",how="inner")

   id  customer_id   name
0   1            3    Joe
1   2            1  Henry

### Leetcode probelm with isin()

In [13]:
Customers[Customers.id.isin(Orders.customer_id)]

   id name
0   1  Joe
2   3  Sam

In [29]:
isin = Customers[~Customers.id.isin(Orders.id)]

In [30]:
isin

   id name
2   3  Sam
3   4  Max

In [33]:
isin1 = isin.rename(columns={
    "name": "customers"
})

In [34]:
isin1

   id customers
2   3       Sam
3   4       Max

In [35]:
pd.DataFrame(isin1.customers)

  customers
2       Sam
3       Max

In [40]:
df1 = pd.DataFrame({'customerID': [1, 2, 3, 4], 'name': ['A', 'B', 'C', 'D']})
df2 = pd.DataFrame({'ID': [1, 2], 'customerID': [2,4]})

In [42]:
pd.merge(df1,df2,on="customerID",how="left")

   customerID name   ID
0           1    A  NaN
1           2    B  1.0
2           3    C  NaN
3           4    D  2.0

In [43]:
pd.merge(df1,df2,on="customerID",how="right")

   customerID name  ID
0           2    B   1
1           4    D   2

In [45]:
pd.merge(df1,df2,how="cross")

   customerID_x name  ID  customerID_y
0             1    A   1             2
1             1    A   2             4
2             2    B   1             2
3             2    B   2             4
4             3    C   1             2
5             3    C   2             4
6             4    D   1             2
7             4    D   2             4